<!-- terraform cdk action for options with hash 89c1ccb2da3d64b997241499927ca750 -->
### ✅ Successfully planned Terraform CDK Stack 'cdktf'



<details><summary>Show Plan</summary>

```shell
... Output truncated to the last 65000 characters ...

alled tailscale/tailscale v0.17.2 (self-signed, key ID 6B5A366F1FD32BD0)
cdktf  - Installing cloudflare/cloudflare v4.48.0...
cdktf  - Installed cloudflare/cloudflare v4.48.0 (self-signed, key ID C76001609EE3B136)
cdktf  - Installing oracle/oci v6.20.0...
cdktf  - Installed oracle/oci v6.20.0 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
       Partner and community providers are signed by their developers.
       If you'd like to know more about provider signing, you can read about it here:
       https://www.terraform.io/docs/cli/plugins/signing.html
       Terraform has created a lock file .terraform.lock.hcl to record the provider
       selections it made above. Include this file in your version control repository
       so that Terraform can guarantee to make the same selections by default when
       you run "terraform init" in the future.
cdktf  HCP Terraform has been successfully initialized!

       You may now begin working with HCP Terraform. Try running "terraform plan" to
       see any changes that are required for your infrastructure.

       If you ever set or change modules or Terraform Settings, run "terraform init"
       again to reinitialize your working directory.
cdktf  - Fetching hashicorp/random 3.6.3 for linux_amd64...
cdktf  - Retrieved hashicorp/random 3.6.3 for linux_amd64 (signed by HashiCorp)
cdktf  - Fetching tailscale/tailscale 0.17.2 for linux_amd64...
cdktf  - Retrieved tailscale/tailscale 0.17.2 for linux_amd64 (self-signed, key ID 6B5A366F1FD32BD0)
cdktf  - Fetching cloudflare/cloudflare 4.48.0 for linux_amd64...
cdktf  - Retrieved cloudflare/cloudflare 4.48.0 for linux_amd64 (self-signed, key ID C76001609EE3B136)
cdktf  - Fetching oracle/oci 6.20.0 for linux_amd64...
cdktf  - Retrieved oracle/oci 6.20.0 for linux_amd64 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
       - Obtained cloudflare/cloudflare checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained oracle/oci checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
cdktf  - Obtained tailscale/tailscale checksums for linux_amd64; All checksums for this platform were already tracked in the lock file

       Success! Terraform has validated the lock file and found no need for changes.
cdktf  Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
       will stop streaming the logs, but will not stop the plan running remotely.

       Preparing the remote plan...
cdktf  To view this run in a browser, visit:
       https://app.terraform.io/app/jon77p-xyz/infrastructure/runs/run-14WtgoSNgMEoox5o
cdktf  Waiting for the plan to start...
cdktf  Terraform v1.10.3
       on linux_amd64
       Initializing plugins and modules...
cdktf  random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_tunnel_secret_7446B080 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-tunnel/tunnel_secret): Refreshing state... [id=AbGGp-Dm0tINpzTIppmZCdJnDQOnxsBVOtUfWA1hhR14RHE]
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret): Refreshing state... [id=--lICuPVvkH3Fe5y13QPPY-proP34zIKH99hNzGDoJKNN7o]
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret): Refreshing state... [id=Glhvgj-vi6m0TruXboPkYZh_y8HBp3Xf0UCiN8upEIFTBU0]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refreshing...
cdktf  random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret): Refreshing state... [id=-NVWV_ZSv9R6CQYpqwvZTqrFgatSaA-k7BKx5ak1jVZJMr4]
cdktf  tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Refreshing state... [id=kQU4mHDLv911CNTRL]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_cf_zones_2DCEFCA4 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-tunnel/cf_zones): Refreshing...
       cloudflare_zero_trust_tunnel_cloudflared.oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201 (oci1/oci1/oci1-vault-tunnel/tunnel_oci1-vault-tunnel): Refreshing state... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refreshing...
       oci_identity_compartment.oci1_terraform_7FF23FED (oci1/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
cdktf  data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refresh complete after 0s [id=26917df6062007ddfe496b5780dfddff]
       oci_identity_compartment.oci0_terraform_38B13C88 (oci0/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refresh complete after 0s [id=26917df6062007ddfe496b5780dfddff]
       oci_identity_compartment.oci2_terraform_3F88AD18 (oci2/terraform): Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq]
       cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737 (oci1/oci1/oci1-vault-tunnel/ingress_record_opconnect_jon77p_xyz): Refreshing state... [id=dbe9ee99a7364c2884047bba057e83d5]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refresh complete after 0s [id=26917df6062007ddfe496b5780dfddff]
       cloudflare_zero_trust_access_application.oci1_oci1-vault-tunnel_ssh_app_68D668B6 (oci1/oci1/oci1-vault-tunnel/ssh_app): Refreshing state... [id=c7f8c997-c490-43d7-820f-140c2b879021]
       cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265 (oci1/oci1/oci1-vault-tunnel/ingress_record_vault_jon77p_xyz): Refreshing state... [id=3fe1c8efbb2fdf221b43d065c2262431]
       cloudflare_record.oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979 (oci1/oci1/oci1-vault-tunnel/ssh_app_oci1-vault-tunnel): Refreshing state... [id=70c80ee55b33e3a109439db22918e5a3]
cdktf  data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-tunnel_cf_zones_2DCEFCA4 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-tunnel/cf_zones): Refresh complete after 1s [id=f64dd1d129b18dfb86637e568821ec50]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=a186ba9f0472d402330ca9ad3a339fa9]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refresh complete after 2s [id=f64dd1d129b18dfb86637e568821ec50]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ingress_record_auth_jon77p_xyz): Refreshing state... [id=e515c1251cbce112aca6fd465b42da6d]
cdktf  cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app): Refreshing state... [id=1a6105f2-8bbb-4d5e-9484-0e71ee40c4a5]
       data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refreshing...
cdktf  cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app): Refreshing state... [id=d53d7997-0893-416f-ab71-3813431b3c82]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=ab8b77ec955582b22ce2923b4774c0d6]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_jon77p_xyz): Refreshing state... [id=4a1966a83a11fe44b967d3e5f2a9eda7]
       data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refresh complete after 1s [id=CoreVcnsDataSource-3604188111]
       data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refreshing...
       data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refreshing...
cdktf  data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refreshing...
cdktf  data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-2346786270]
       data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refreshing...
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
cdktf  data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ads_39D25F8E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ads): Refreshing...
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refreshing...
cdktf  data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refreshing...
cdktf  data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-1699921964]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_thepi_cloud): Refreshing state... [id=eae4e14590f8b9d2578762eda49106ae]
cdktf  data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ads_39D25F8E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaac7uydq54rcymamzauv5pd23qk2g2vqlrfu5jd3y6i6qxpvvzkf7a]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5na6fgukt55idgvuwz6oxuxppchwkucykqkpya]
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       cloudflare_zero_trust_access_policy.oci1_oci1-vault-tunnel_ssh_policy_11AD3224 (oci1/oci1/oci1-vault-tunnel/ssh_policy): Refreshing state... [id=b159d8b9-8897-491b-8e67-b7aa2579a7c8]
       cloudflare_zero_trust_access_short_lived_certificate.oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A (oci1/oci1/oci1-vault-tunnel/ssh_certificate): Refreshing state... [id=32a8d6d54964452d82c0dc9a138f6772be92fcd886b6ba7b]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_app_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=465b523b137f5715b1f27f69f00c0c2e]
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-1699921964]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r7byz5coah7q3ydm5td2tqospnrarqfdladzq]
       data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refreshing...
cdktf  data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2062574658]
cdktf  module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpgwdszc5hmqlc6ymzzt2tfmpo4f7a]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5ifhvhrlao2jyu74eyk5usszmyf3waetjsx4rmq]
cdktf  data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
cdktf  cloudflare_record.oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE (oci1/oci1/oci1-vault-tunnel/tunnel_app_oci1-vault-tunnel): Refreshing state... [id=c697ab72be5d2a3779e48cee051c6c9c]
       data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_all_boot_volumes_CC55AE73 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/all_boot_volumes): Refreshing...
cdktf  data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_all_boot_volumes_CC55AE73 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2286997786]
cdktf  data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=6f68342b8a4b1cf42f8aaa74256964fb]
cdktf  module.oci0_oci0-base_vcn_D4433BAC.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaag57fq3pfzgkbochyed4rqyrcddn25s3jpvirj6bbqeotls5f3eya]
cdktf  module.oci0_oci0-base_vcn_D4433BAC.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaag2aj3c3enodxesoc34h2grrcop47e4dtgbgazsuzrfgsyxrhk2ca]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaa4wjsjitbn4ljsaqzm2j5iygvo4f6cc4otdf6l3egoacq3x2tmmva]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaaityfw6ve3az2wjqpasxnyx66ahlnqtgfgmoizoal5j2whv2g7b4q]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.phx.aaaaaaaaejqniplxid6hmuclowhsl74w6yzv6uu544mnuiwu6v3cdot53daa]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.phx.aaaaaaaajxb7st3mq35s4bplypp57xmxkmgpvi6aq5snrce3k77w2jhxuszq]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaayvztzez36b75cwjge7qgldkxvy3vojdqhft5jheopuzbbla4je7q]
cdktf  module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxtr7mjutnldyymcpypxb664aejeq26kh2vtcubwhhcknurds7ttq]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_certificate): Refreshing state... [id=80e280bba2cfb1c7fb83f0b93853632445d0e5abc01a2963]
       oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaawtp6d5c6ozttjuaqwl3mb5nvzxrvgau4axetce7qw5zbodxcwwia]
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_policy): Refreshing state... [id=4ba4f5d5-0356-4d8c-86d2-145159c20112]
       oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaadp5drabvdrgwngdlrznym57teme2dwq2vz53gxmzedgulyziqxhq]
cdktf  oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.phx.aaaaaaaaztrccu4ldwgkqdfvpso42fpnjgyevkgvmbdtcwauftptyltlmd7q]
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_policy): Refreshing state... [id=3102b295-0795-49e9-a89a-001fa0d01bd5]
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_certificate): Refreshing state... [id=38b70b4e3d9f21056d9d4cbfba58105226bd25698fc61b12]
cdktf  oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list): Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxrc4f4tlkmgbo2s532zsczio676a3cubdfu52xb2gr2nokjp7kva]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaax7d4ml5husv43cxsmoayue4vgonjdcn4p5n7zzx7h326bd4ovlhq]
cdktf  module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.phx.aaaaaaaanx5vudvrhnq35ulihzdvl5xcnfuym625xsiffaey6lmthdpqqzta]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaajbzpf4bmxuijiddf4nussdevcyhemgemmwi7gxnow7sjok35kcmq]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaavsf3rv2q3qzztzicekvcvg7akgdoqhkiip447geu3iqq5vl6o2za]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Refreshing state... [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/private): Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaadhungsdaobawobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq]
       oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/public): Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna]
       oci_core_subnet.oci0_oci0-base_public_F5847813 (oci0/oci0/oci0-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq]
       oci_core_subnet.oci0_oci0-base_private_3EAB705B (oci0/oci0/oci0-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaixrvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Refreshing state... [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       oci_core_subnet.oci1_oci1-base_public_E80D1048 (oci1/oci1/oci1-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.phx.anyhqljrvaxvekyctfk4lsyiblugfachhplrasfusaszm7x4f53efdtgxkwa]
       oci_core_subnet.oci1_oci1-base_private_757CEF5F (oci1/oci1/oci1-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatyttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq]
cdktf  oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/public): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/private): Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq]
cdktf  cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Refreshing state... [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyci7xoin6qkpuxgmw3woshmyd5cx4grhqcr43rzhd64ocq]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3t2kkplfdii2zpd7jkvj7mwfjqj6goqtgklx2laaeuwa]
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-record): Refreshing state... [id=9e38842f8d30d2fbb8adf3eb496e45a9]
       cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Refreshing state... [id=b08082b9ad457e047dd24056901770b3]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Refreshing state... [id=088bc807ead737ed3fa6983fbc7ebfd4]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3dzxrjju2m3t6rgokupwfjp2vivcniyhqnb4p3ecuuva]
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Refreshing state... [id=63167681b29dd7c53160cea2ad0221b1]
cdktf  tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Drift detected (delete)
cdktf  Note: Objects have changed outside of Terraform

       Terraform detected the following changes made outside of Terraform since the
       last "terraform apply" which may have affected this plan:
cdktf  # tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key) has been deleted
         - resource "tailscale_tailnet_key" "tailscale_auth_key" {
               id            = "kQU4mHDLv911CNTRL"
             - key           = (sensitive value) -> null
               tags          = [
                   "tag:cdktf",
                   "tag:oci",
                   "tag:ssh",
               ]
               # (7 unchanged attributes hidden)
           }


       Unless you have made equivalent changes to your configuration, or ignored the
       relevant attributes using ignore_changes, the following plan may include
       actions to undo or respond to these changes.

       ─────────────────────────────────────────────────────────────────────────────

       Terraform used the selected providers to generate the following execution
       plan. Resource actions are indicated with the following symbols:
         + create
         ~ update in-place
       -/+ destroy and then create replacement

       Terraform will perform the following actions:

         # cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record) will be updated in-place
         ~ resource "cloudflare_record" "oci1_oci1-vault-record_DD9AADE3" {
             ~ content         = "146.235.227.211" -> (known after apply)
               id              = "b08082b9ad457e047dd24056901770b3"
               name            = "vault.oci1.jon77p.xyz"
               tags            = []
               # (11 unchanged attributes hidden)
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-record) will be updated in-place
         ~ resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-record_1F10E1F6" {
             ~ content         = "129.146.71.24" -> (known after apply)
               id              = "9e38842f8d30d2fbb8adf3eb496e45a9"
               name            = "monitoring.oci2-us-phoenix-1.thepi.cloud"
               tags            = []
               # (11 unchanged attributes hidden)
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record) will be updated in-place
         ~ resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0" {
             ~ content         = "152.70.122.178" -> (known after apply)
               id              = "088bc807ead737ed3fa6983fbc7ebfd4"
               name            = "auth.oci2-us-sanjose-1.jon77p.xyz"
               tags            = []
               # (12 unchanged attributes hidden)
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record) will be updated in-place
         ~ resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6" {
             ~ content         = "129.159.43.136" -> (known after apply)
               id              = "63167681b29dd7c53160cea2ad0221b1"
               name            = "healthchecks.oci2-us-sanjose-1.jon77p.xyz"
               tags            = []
               # (12 unchanged attributes hidden)
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910" {
               id         = "dead9a0a-014b-47d7-b0c1-6e256ad60c3f"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (8 unchanged blocks hidden)
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E" {
               id         = "1a54b4fc-edea-4531-97f2-34283bbf6091"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (7 unchanged blocks hidden)
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel) will be updated in-place
         ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470" {
               id         = "491d0111-6836-4515-9bb6-20e0ade12a7c"
               # (2 unchanged attributes hidden)

             ~ config {
                 + warp_routing {
                     + enabled = true
                   }

                   # (8 unchanged blocks hidden)
               }
           }

         # oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance) must be replaced
       -/+ resource "oci_core_instance" "oci1_oci1-vault-compute_ubuntu_instance_3E6E0388" {
             ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq" -> (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             ~ defined_tags                        = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.883Z"
               } -> (known after apply)
             ~ extended_metadata                   = {} -> (known after apply)
             ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
             ~ freeform_tags                       = {} -> (known after apply)
             ~ hostname_label                      = "vault" -> (known after apply)
             ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnyci7xoin6qkpuxgmw3woshmyd5cx4grhqcr43rzhd64ocq" -> (known after apply)
             ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             ~ is_cross_numa_node                  = false -> (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
             ~ metadata                            = {
                 - "user_data" = (sensitive value)
               } -> (known after apply) # forces replacement
             ~ private_ip                          = "10.0.0.21" -> (known after apply)
             ~ public_ip                           = "146.235.227.211" -> (known after apply)
             ~ region                              = "us-sanjose-1" -> (known after apply)
             ~ security_attributes                 = {} -> (known after apply)
             ~ security_attributes_state           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea" -> (known after apply)
             ~ system_tags                         = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> (known after apply)
             ~ time_created                        = "2024-09-22 01:27:59.671 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:59.033Z"
                   } -> (known after apply)
                 ~ display_name              = "vault" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.21" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 1 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
                 ~ vcpus                         = 2 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-monitoring-compute/ubuntu_instance) must be replaced
       -/+ resource "oci_core_instance" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_ubuntu_instance_3889690A" {
             ~ boot_volume_id                      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             ~ defined_tags                        = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2024-09-22T01:26:54.662Z"
               } -> (known after apply)
             ~ extended_metadata                   = {} -> (known after apply)
             ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
             ~ freeform_tags                       = {} -> (known after apply)
             ~ hostname_label                      = "monitoring" -> (known after apply)
             ~ id                                  = "ocid1.instance.oc1.phx.anyhqljrvaxvekyctfk4lsyiblugfachhplrasfusaszm7x4f53efdtgxkwa" -> (known after apply)
             ~ image                               = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq" -> (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             ~ is_cross_numa_node                  = false -> (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
             ~ metadata                            = {
                 - "user_data" = (sensitive value)
               } -> (known after apply) # forces replacement
             ~ private_ip                          = "10.0.0.49" -> (known after apply)
             ~ public_ip                           = "129.146.71.24" -> (known after apply)
             ~ region                              = "phx" -> (known after apply)
             ~ security_attributes                 = {} -> (known after apply)
             ~ security_attributes_state           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna" -> (known after apply)
             ~ system_tags                         = {} -> (known after apply)
             ~ time_created                        = "2024-09-22 01:26:55.327 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-22T01:26:54.809Z"
                   } -> (known after apply)
                 ~ display_name              = "monitoring" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.49" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 4 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
                 ~ vcpus                         = 4 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance) must be replaced
       -/+ resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68" {
             ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq" -> (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             ~ defined_tags                        = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.809Z"
               } -> (known after apply)
             ~ extended_metadata                   = {} -> (known after apply)
             ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
             ~ freeform_tags                       = {} -> (known after apply)
             ~ hostname_label                      = "auth" -> (known after apply)
             ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3t2kkplfdii2zpd7jkvj7mwfjqj6goqtgklx2laaeuwa" -> (known after apply)
             ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             ~ is_cross_numa_node                  = false -> (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
             ~ metadata                            = {
                 - "user_data" = (sensitive value)
               } -> (known after apply) # forces replacement
             ~ private_ip                          = "10.0.0.79" -> (known after apply)
             ~ public_ip                           = "152.70.122.178" -> (known after apply)
             ~ region                              = "us-sanjose-1" -> (known after apply)
             ~ security_attributes                 = {} -> (known after apply)
             ~ security_attributes_state           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa" -> (known after apply)
             ~ system_tags                         = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> (known after apply)
             ~ time_created                        = "2024-09-22 01:27:59.453 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.952Z"
                   } -> (known after apply)
                 ~ display_name              = "auth" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.79" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 1 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
                 ~ vcpus                         = 2 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance) must be replaced
       -/+ resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A" {
             ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq" -> (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             ~ defined_tags                        = {
                 - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                 - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.771Z"
               } -> (known after apply)
             ~ extended_metadata                   = {} -> (known after apply)
             ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
             ~ freeform_tags                       = {} -> (known after apply)
             ~ hostname_label                      = "healthchecks" -> (known after apply)
             ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc3dzxrjju2m3t6rgokupwfjp2vivcniyhqnb4p3ecuuva" -> (known after apply)
             ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa" -> (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             ~ is_cross_numa_node                  = false -> (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
             ~ metadata                            = {
                 - "user_data" = (sensitive value)
               } -> (known after apply) # forces replacement
             ~ private_ip                          = "10.0.0.104" -> (known after apply)
             ~ public_ip                           = "129.159.43.136" -> (known after apply)
             ~ region                              = "us-sanjose-1" -> (known after apply)
             ~ security_attributes                 = {} -> (known after apply)
             ~ security_attributes_state           = "STABLE" -> (known after apply)
             ~ state                               = "RUNNING" -> (known after apply)
             ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa" -> (known after apply)
             ~ system_tags                         = {
                 - "orcl-cloud.free-tier-retained" = "true"
               } -> (known after apply)
             ~ time_created                        = "2024-09-22 01:27:59.369 +0000 UTC" -> (known after apply)
             + time_maintenance_reboot_due         = (known after apply)
               # (5 unchanged attributes hidden)

             ~ agent_config (known after apply)
             - agent_config {
                 - are_all_plugins_disabled = false -> null
                 - is_management_disabled   = false -> null
                 - is_monitoring_disabled   = false -> null
               }

             ~ availability_config (known after apply)
             - availability_config {
                 - is_live_migration_preferred = false -> null
                 - recovery_action             = "RESTORE_INSTANCE" -> null
               }

             ~ create_vnic_details {
                 ~ assign_ipv6ip             = false -> (known after apply)
                 ~ defined_tags              = {
                     - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                     - "Oracle-Tags.CreatedOn" = "2024-09-22T01:27:58.904Z"
                   } -> (known after apply)
                 ~ display_name              = "healthchecks" -> (known after apply)
                 ~ freeform_tags             = {} -> (known after apply)
                 ~ nsg_ids                   = [] -> (known after apply)
                 ~ private_ip                = "10.0.0.104" -> (known after apply)
                 ~ security_attributes       = {} -> (known after apply)
                 ~ skip_source_dest_check    = false -> (known after apply)
                 + vlan_id                   = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             ~ instance_options (known after apply)
             - instance_options {
                 - are_legacy_imds_endpoints_disabled = false -> null
               }

             ~ launch_options (known after apply)
             - launch_options {
                 - boot_volume_type                    = "PARAVIRTUALIZED" -> null
                 - firmware                            = "UEFI_64" -> null
                 - is_consistent_volume_naming_enabled = true -> null
                 - is_pv_encryption_in_transit_enabled = false -> null
                 - network_type                        = "PARAVIRTUALIZED" -> null
                 - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
               }

             ~ launch_volume_attachments (known after apply)

             ~ platform_config (known after apply)

             ~ preemptible_instance_config (known after apply)

             ~ shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 ~ gpus                          = 0 -> (known after apply)
                 + local_disk_description        = (known after apply)
                 ~ local_disks                   = 0 -> (known after apply)
                 ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
                 ~ max_vnic_attachments          = 1 -> (known after apply)
                 ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
                 ~ nvmes                         = 0 -> (known after apply)
                 ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
                 ~ vcpus                         = 2 -> (known after apply)
                   # (2 unchanged attributes hidden)
               }

             ~ source_details {
                 + boot_volume_size_in_gbs         = (known after apply)
                 + boot_volume_vpus_per_gb         = (known after apply)
                   # (4 unchanged attributes hidden)

                 ~ instance_source_image_filter_details (known after apply)
               }
           }

         # tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key) will be created
         + resource "tailscale_tailnet_key" "tailscale_auth_key" {
             + created_at    = (known after apply)
             + ephemeral     = false
             + expires_at    = (known after apply)
             + id            = (known after apply)
             + invalid       = (known after apply)
             + key           = (sensitive value)
             + preauthorized = true
             + reusable      = true
             + tags          = [
                 + "tag:cdktf",
                 + "tag:oci",
                 + "tag:ssh",
               ]
           }

       Plan: 5 to add, 7 to change, 4 to destroy.

       Changes to Outputs:
         ~ oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07                                          = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljreozywd2p65q72syl76slcrlz5to6wyqgdm6c4h2ogj4b5rjxe7dq" -> (known after apply)
         ~ oci1_oci1-vault-compute_instance-source-details_49B43EF8                                       = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-boot-volume_56D85552      = "ocid1.bootvolume.oc1.phx.abyhqljrmocedue3fnn6uhnn6jlrtkf2jsa4jrxwdeysqt3rnugys7xuqffq" -> (known after apply)
         ~ oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-monitoring-compute_instance-source-details_EBF73E6F   = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq" -> (known after apply)
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA         = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6    = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq" -> (known after apply)
         ~ oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
             ~ boot_volume_size_in_gbs              = "" -> (known after apply)
             ~ boot_volume_vpus_per_gb              = "" -> (known after apply)
             ~ instance_source_image_filter_details = [] -> (known after apply)
             ~ kms_key_id                           = "" -> null
               # (3 unchanged attributes hidden)
           }
cdktf  Post-plan Tasks:
cdktf  All tasks completed! 1 passed, 0 failed           (4s elapsed)

       │ Snyk ⸺   Passed
       │ No issues found.
       Severity threshold is set to low.
cdktf  │ Details: https://app.snyk.io/org/jon77p/project/0fe83cb2-98ca-4577-b078-fd048f4c1e02/history/d7303489-7278-48e3-b040-f42bf5c0c2af
       │
       │
       │ Overall Result: Passed

       ------------------------------------------------------------------------
cdktf  ------------------------------------------------------------------------

       Cost Estimation:

       Resources: 0 of 66 estimated
                  $0.0/mo +$0.0

       ─────────────────────────────────────────────────────────────────────────────
cdktf  Note: You didn't use the -out option to save this plan, so Terraform can't
       guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>